; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v4)
		(pred_1 ?v3)
		(pred_6 ?v1)
		(pred_3 ?v1)
		(pred_2 ?v3 ?v1)
		(pred_5)
		(pred_4 ?v3))

   (:action op_2
       :parameters  (?v8 ?v2)
       :precondition (and (not-eq ?v8 ?v2) 
                          (pred_6 ?v8) (pred_6 ?v2) (pred_3 ?v8))
       :effect (and  (pred_3 ?v2)
		     (not (pred_3 ?v8))))


   (:action op_3
       :parameters (?v5 ?v6)
       :precondition  (and  (pred_1 ?v5) (pred_6 ?v6)
			    (pred_2 ?v5 ?v6) (pred_3 ?v6) (pred_5))
       :effect (and (pred_4 ?v5)
		    (not (pred_2 ?v5 ?v6)) 
		    (not (pred_5))))

   (:action op_1
       :parameters  (?v5  ?v6)
       :precondition  (and  (pred_1 ?v5) (pred_6 ?v6)
			    (pred_4 ?v5) (pred_3 ?v6))
       :effect (and (pred_2 ?v5 ?v6)
		    (pred_5)
		    (not (pred_4 ?v5)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_01 obj_02 obj_03 
          obj_05 obj_06 obj_04 
)
(:init
(pred_6 obj_01)
(pred_6 obj_02)
(pred_6 obj_03)
(pred_1 obj_05)
(pred_1 obj_06)
(pred_1 obj_04)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(pred_5)
(pred_2 obj_05 obj_03)
(pred_2 obj_06 obj_02)
(pred_2 obj_04 obj_03)
(pred_3 obj_03)
)
(:goal
(and
(pred_2 obj_05 obj_01)
(pred_2 obj_06 obj_01)
(pred_2 obj_04 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_05 obj_01) (pred_3 obj_02))
    (sometime-before  (pred_2 obj_06 obj_01) (pred_3 obj_03))
    (sometime-before  (pred_2 obj_04 obj_01) (pred_3 obj_02))
  )
)
)

; plan
1. (op_3 obj_04 obj_03)
   deleted: (pred_2 obj_04 obj_03) (pred_5)
   added: (pred_4 obj_04)
   goals met: 0 of 3
2. (op_2 obj_03 obj_02)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_02)
   goals met: 0 of 3
3. (op_1 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_2 obj_04 obj_02) (pred_5)
   goals met: 0 of 3
4. (op_3 obj_06 obj_02)
   deleted: (pred_2 obj_06 obj_02) (pred_5)
   added: (pred_4 obj_06)
   goals met: 0 of 3
5. (op_2 obj_02 obj_01)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_01)
   goals met: 0 of 3
6. (op_1 obj_06 obj_01)
   deleted: (pred_4 obj_06)
   added: (pred_2 obj_06 obj_01) (pred_5)
   goals met: 1 of 3
7. (op_2 obj_01 obj_03)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_03)
   goals met: 1 of 3
8. (op_3 obj_05 obj_03)
   deleted: (pred_2 obj_05 obj_03) (pred_5)
   added: (pred_4 obj_05)
   goals met: 1 of 3
9. (op_2 obj_03 obj_02)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_02)
   goals met: 1 of 3
10. (op_2 obj_02 obj_01)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_01)
   goals met: 1 of 3
11. (op_1 obj_05 obj_01)
   deleted: (pred_4 obj_05)
   added: (pred_2 obj_05 obj_01) (pred_5)
   goals met: 2 of 3
12. (op_2 obj_01 obj_02)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_02)
   goals met: 2 of 3
13. (op_3 obj_04 obj_02)
   deleted: (pred_2 obj_04 obj_02) (pred_5)
   added: (pred_4 obj_04)
   goals met: 2 of 3
14. (op_2 obj_02 obj_01)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_01)
   goals met: 2 of 3
15. (op_1 obj_04 obj_01)
   deleted: (pred_4 obj_04)
   added: (pred_2 obj_04 obj_01) (pred_5)
   goals met: 3 of 3
